{
  "project_name": "train_ikea",
  "target_url": "https://www.ikea.com",
  "workflow_description": "Navigate to IKEA homepage. Verify the hero headline contains 'Affordable furniture and home goods'. Find and click the 'Shop Products' button.",
  "docs": "",
  "domain": "ecommerce",
  "testing_type": "smoke",
  "test_data": {
    "username": "standard_user",
    "password": "secret_sauce",
    "firstName": "John",
    "lastName": "Doe",
    "postalCode": "12345"
  },
  "paths": {
    "trace": "projects/train_ikea/outputs/trace.json",
    "report": "projects/train_ikea/outputs/report.md",
    "test": "projects/train_ikea/tests/e2e/test_main.py",
    "cache": "projects/train_ikea/knowledge/locator_cache.json"
  },
  "master_plan": "Okay, here's a Master Test Plan for IKEA.com, designed to guide autonomous agents through a targeted smoke test.\n\n# Master Test Plan: IKEA.com - Smoke Test\n\n**Document Version:** 1.0\n**Date:** October 26, 2023\n**Target URL:** https://www.ikea.com\n**Business Domain:** Ecommerce\n**Testing Type:** Smoke\n**User Goal:** Navigate to IKEA homepage, Verify the hero headline contains 'Affordable furniture and home goods', Find and click the 'Shop Products' button.\n**Prepared by:** AI QA Strategist\n\n## 1. Domain Information and Analysis\n\nIKEA.com is the online presence of IKEA, a multinational group that designs and sells ready-to-assemble furniture, kitchen appliances, home accessories, and other goods and home services. As a high-traffic e-commerce platform, its website's stability and core functionality are critical.\n\n**Key Domain Characteristics:**\n\n*   **Vast Product Catalog:**  A very large and diverse inventory of products.\n*   **Complex Navigation:**  Extensive menu system, search functionality, and filtering options are in place.\n*   **Localized Experiences:**  IKEA operates in numerous countries, with each site tailored to local languages, currencies, and product availability.  This test plan assumes the primary (likely US) locale.\n*   **E-commerce Functionality:** Includes shopping cart, checkout process, account management, and order tracking.\n*    **Promotional Content:** Regularly updated promotional banners and offers.\n\n**Testing Considerations:**\n\n*   Page load times are crucial due to the high volume of traffic.\n*   Mobile responsiveness is vital, given the significant proportion of mobile users.\n*   Search functionality must be accurate and efficient.\n*   The checkout process needs to be seamless and secure.\n\n## 2. Smoke Suite Definition\n\nThis smoke suite focuses on verifying the most critical functionalities of IKEA.com to ensure the site is operational and the core user journey is not broken.\n\n**A. Website Availability Check:**\n\n*   **Test Case ID:** SMOKE-001\n*   **Test Description:** Verify that the IKEA.com homepage loads successfully with a 200 OK status code.\n*   **Steps:**\n    1.  Navigate to https://www.ikea.com.\n    2.  Verify that the HTTP status code is 200.\n*   **Expected Result:** The homepage loads without errors, and the HTTP status code is 200.\n\n**B. Core Navigation Menu Verification:**\n\n*   **Test Case ID:** SMOKE-002\n*   **Test Description:** Verify that the main menu links are present and navigate to the correct pages.\n*   **Steps:**\n    1.  Navigate to https://www.ikea.com.\n    2.  Locate the main navigation menu (using a reliable selector like `header[role=\"banner\"] nav`).\n    3.  Verify that at least 5 main categories are visible (e.g., \"Furniture,\" \"Kitchen,\" \"Decoration,\" \"Lighting,\" \"Outdoor\").\n    4.  Click on the \"Furniture\" link.\n    5.  Verify that the Furniture category page loads successfully.\n*   **Expected Result:** The main menu is displayed correctly, and each top-level link navigates to the appropriate category page.\n\n**C. Core Flow: \"Shop Products\" Happy Path**\n\n*   **Test Case ID:** SMOKE-003\n*   **Test Description:** Verify user can navigate to the homepage, verify the hero headline, and click the \"Shop Products\" button.\n*   **Pre-Conditions:** None\n*   **Steps:**\n    1.  Navigate to https://www.ikea.com.\n    2.  Locate the main hero section (using a reliable selector such as `div[class*=\"Hero\"]` or `section[aria-label*=\"Hero\"]`).\n    3.  Verify that the hero headline contains the text \"Affordable furniture and home goods\".\n    4.  Locate the \"Shop Products\" button within the hero section (using text-based or semantic selectors, e.g., `a:contains('Shop Products')` or `a[aria-label*='Shop Products']`).\n    5.  Click the \"Shop Products\" button.\n    6.  Verify that a product listing page loads (e.g., a page with product cards displayed). A simple verification could be that the URL changes or that elements with a product class such as 'product-card' exist.\n*   **Expected Result:** The hero section displays the correct headline, the \"Shop Products\" button is clickable, and clicking the button navigates the user to a relevant product listing page.\n\n## 3. Strategic Mining Instructions\n\nThese instructions guide the autonomous agent on which elements and pages to prioritize for deeper analysis and potential test case generation *beyond* the smoke tests. The goal is to efficiently discover potential issues and expand test coverage.\n\n**A. High-Priority Elements:**\n\n*   **Search Bar:**  `input[type=\"search\"]` - Focus on input validation, auto-suggestions, and search result accuracy. Mine different search terms (product names, categories, IDs) to assess result quality.\n*   **Product Cards:** `div[class*='product-card']` - Analyze the structure, data attributes, and links within product cards. Verify consistency and accuracy of displayed information (name, price, image).\n*   **Add to Cart Button:** `button:contains('Add to cart')` - Critical for e-commerce functionality. Monitor click events, shopping cart updates, and potential error handling.\n*   **Shopping Cart Icon:** `a[href*='/cart']` - Track changes in the cart count and link integrity.\n*   **Hero Banners/Promotional Carousels:** `div[class*='carousel']`, `section[aria-label*='Hero']` - Monitor content updates, link validity, and performance.\n*   **Footer Links:** `footer a` - Check for broken links and ensure important information (e.g., \"Contact Us,\" \"Privacy Policy\") is accessible.\n\n**B. High-Priority Pages:**\n\n*   **Homepage (/)**: Central entry point; prioritize monitoring of content updates and layout consistency.\n*   **Search Results Page (/search?q=...)**:  Crucial for product discovery; analyze result accuracy, filtering options, and pagination.\n*   **Product Detail Pages (/p/...)**:  Verify product information, image display, availability status, and \"Add to Cart\" functionality.\n*   **Shopping Cart Page (/cart)**:  Test cart updates, quantity adjustments, and checkout initiation.\n*   **Checkout Pages (/checkout)**:  Critical for revenue generation; prioritize testing of payment processing, address validation, and order confirmation.\n*   **Account Pages (/account)**: User profile, order history, saved addresses etc.\n\n**C. Mining Strategy:**\n\n1.  **Element Discovery:** Use CSS selectors and XPath expressions to identify key elements on the high-priority pages.\n2.  **Attribute Extraction:** Extract relevant attributes from these elements (e.g., `href`, `src`, `alt`, `data-*`).\n3.  **Content Analysis:** Analyze the text content of elements for consistency, accuracy, and potential errors (e.g., typos, broken links, incorrect pricing).\n4.  **Interaction Monitoring:** Track user interactions with elements (e.g., clicks, form submissions) to identify potential issues.\n5.  **Performance Measurement:** Measure page load times and element rendering times to identify performance bottlenecks.\n\n## 4. Test Environment\n\n*   **Browser:** Google Chrome (latest stable version)\n*   **Operating System:** Windows 10/11 or macOS (latest version)\n*   **Screen Resolution:** 1920x1080\n*   **Network:** Stable internet connection with sufficient bandwidth.\n\n## 5. Reporting\n\n*   Defects found during the smoke test should be reported immediately with high priority.\n*   A summary report of the smoke test results should be generated, including the number of tests passed, failed, and skipped.\n*   The report should include details of any failed tests, including error messages, screenshots, and steps to reproduce.\n\n## 6.  Future Considerations\n\n*   **Localization Testing:**  Expand the test suite to include different IKEA regional sites.\n*   **Accessibility Testing:**  Incorporate accessibility checks to ensure compliance with WCAG guidelines.\n*   **Performance Testing:**  Conduct load tests and stress tests to evaluate the website's performance under heavy traffic.\n*   **Security Testing:**  Perform security scans to identify potential vulnerabilities.\n\nThis Master Test Plan provides a solid foundation for automating smoke tests and strategically mining IKEA.com for potential issues.  The agent should be instructed to follow these guidelines to ensure efficient and effective test coverage."
}