[
  {
    "url": "https://www.automationexercise.com/",
    "title": "Automation Exercise",
    "summary": "This is a full-fledged e-commerce website called AutomationExercise designed for QA engineers of all levels to practice automation and API testing. It provides test cases, API lists, and video tutorials. The site features product categories like WOMEN, MEN, and KIDS, as well as brands like POLO, H&M, and MADAME."
  },
  {
    "url": "https://www.automationexercise.com/category_products/1",
    "title": "Automation Exercise - Dress Products",
    "summary": "This webpage displays dress products for women in an online store. It includes categories for women, men, and kids, as well as brands like POLO, H&M, and MADAME. The page lists several dress products with prices and 'Add to cart' buttons, and 'View Product' buttons."
  },
  {
    "url": "https://www.automationexercise.com/product_details/22",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, specifically a 'Long Maxi Tulle Fancy Dress Up Outfits - Pink'. It shows the product's category (Kids > Dress), price (Rs. 1600), availability (In Stock), condition (New), and brand (Biba). Users can add the product to their cart, write a review, and subscribe to receive updates."
  },
  {
    "url": "https://www.automationexercise.com/category_products/7",
    "title": "Automation Exercise - Saree Products",
    "summary": "This is a webpage for an online store, specifically featuring saree products within an automation exercise context. The page includes navigation links (Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, Contact us), product categories (Women, Men, Kids), brands, and a listing of saree products with details like price and 'Add to cart' functionality. Some products also have a 'View Product' option."
  },
  {
    "url": "https://www.automationexercise.com/product_details/38",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, a Rose Pink Embroidered Maxi Dress, including its category (Women > Dress), price (Rs. 2300), availability (In Stock), condition (New), and brand (Madame). It also allows users to add the product to their cart, write and submit a review, and subscribe to receive updates."
  },
  {
    "url": "https://www.automationexercise.com/product_details/11",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product called 'Sleeves Printed Top - White' on an e-commerce website. It shows the product category (Kids > Tops & Shirts), price (Rs. 499), availability (In Stock), condition (New), and brand (Babyhug). It also includes options to add the product to the cart, write a review, and subscribe to updates."
  },
  {
    "url": "https://www.automationexercise.com/category_products/3",
    "title": "Automation Exercise - Tshirts Products",
    "summary": "This webpage displays a list of T-shirts for men from an e-commerce website called Automation Exercise. The page includes navigation links for Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, and Contact us. It also has category filters for Women, Men, and Kids, as well as brand filters. The T-shirts are displayed with their prices and 'Add to cart' buttons, and some have a 'View Product' option."
  },
  {
    "url": "https://www.automationexercise.com/product_details/18",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, 'Little Girls Mr. Panda Shirt', including its category (Kids > Tops & Shirts), price (Rs. 1200), availability (In Stock), condition (New), and brand (Kookie Kids). It also allows users to add the product to the cart, write and submit a review, and subscribe to receive updates."
  },
  {
    "url": "https://www.automationexercise.com/brand_products/Biba",
    "title": "Automation Exercise - Biba Products",
    "summary": "This is the homepage of an e-commerce website called Biba Products. The page displays a navigation bar with links to Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, and Contact us. The main content area lists products from the Biba brand, including dresses with prices and 'Add to cart' buttons. There are also category filters for WOMEN, MEN, KIDS, and BRANDS, with counts for each brand (POLO, H&M, MADAME, etc.)."
  },
  {
    "url": "https://www.automationexercise.com/product_details/37",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a specific product, 'Grunt Blue Slim Fit Jeans', including its category (Men > Jeans), price (Rs. 1400), availability (In Stock), condition (New), and brand (Polo). It also provides options to add the product to the cart, write a review, and subscribe to site updates."
  },
  {
    "url": "https://www.automationexercise.com/product_details/35",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, 'Regular Fit Straight Jeans', including its category (Men > Jeans), price (Rs. 1200), availability (In Stock), condition (New), and brand (H&M). It also allows users to add the product to the cart, write and submit a review, and subscribe to receive updates."
  },
  {
    "url": "https://www.automationexercise.com/product_details/24",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product (Colour Blocked Shirt – Sky Blue) on an e-commerce website. It shows the product's category (Kids > Tops & Shirts), price (Rs. 849), availability (In Stock), condition (New), and brand (Allen Solly Junior). It also includes options to add the product to the cart, write a review, and subscribe to updates."
  },
  {
    "url": "https://www.automationexercise.com/product_details/7",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a specific product, 'Madame Top For Women', including its category (Women > Tops), price (Rs. 1000), availability (In Stock), condition (New), and brand (Madame). It allows users to add the product to their cart, write and submit a review, and subscribe to receive updates. The page also includes navigation links to Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, and Contact us, as well as product categories (WOMEN, MEN, KIDS) and brands (POLO, H&M, MADAME, MAST & HARBOUR, BABYHUG, ALLEN SOLLY JUNIOR, KOOKIE KIDS, BIBA)."
  },
  {
    "url": "https://www.automationexercise.com/product_details/4",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, including its category, price, availability, condition, brand, and a form to write a review. It also includes options to add the product to the cart and a subscription section for updates."
  },
  {
    "url": "https://www.automationexercise.com/brand_products/H&M",
    "title": "Automation Exercise - H&M Products",
    "summary": "This is a summary of an automated test exercise focused on H&M products. The page displays a list of H&M products with options to add to cart or view product details. It also includes categories (WOMEN, MEN, KIDS), brands, and navigation links (Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, Contact us)."
  },
  {
    "url": "https://www.automationexercise.com/product_details/28",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product (Pure Cotton V-Neck T-Shirt) on an e-commerce website. It shows the product's category, price, quantity input with an 'Add to cart' button, availability, condition, brand, and a section to write and submit a review. It also includes website navigation links (Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, Contact us), product categories (WOMEN, MEN, KIDS), brands, a subscription section, and copyright information."
  },
  {
    "url": "https://www.automationexercise.com/view_cart",
    "title": "Automation Exercise - Checkout",
    "summary": "This webpage is for an automation exercise, specifically the checkout process of a shopping cart. The cart is currently empty, and users are prompted to buy products. There is also a subscription section for updates."
  },
  {
    "url": "https://www.automationexercise.com/product_details/15",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, 'Printed Off Shoulder Top - White', including its category (Kids > Tops & Shirts), price (Rs. 315), availability (In Stock), condition (New), and brand (Babyhug). It also allows users to add the product to their cart, write and submit a review, and subscribe to receive updates."
  },
  {
    "url": "https://www.automationexercise.com/product_details/21",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, specifically a 'Blue Cotton Indie Mickey Dress'. It shows the product's category (Kids > Dress), price (Rs. 1530), availability (In Stock), condition (New), and brand (Biba). It also includes options to add the product to the cart, write a review, and subscribe to updates. The page also has navigation links for Home, Products, Cart, Signup/Login, Test Cases, API Testing, and Video Tutorials, Contact us, as well as category filters for Women, Men, and Kids, and brand filters."
  },
  {
    "url": "https://www.automationexercise.com/login",
    "title": "Automation Exercise - Signup / Login",
    "summary": "This webpage provides options for users to either log in to an existing account or sign up for a new account. It also includes links to other pages such as Products, Cart, Test Cases, API Testing, Video Tutorials, and Contact us. A subscription section is present, and a copyright notice is displayed at the bottom."
  }
]