{
  "project_name": "train_cleveland_clinic",
  "target_url": "https://my.clevelandclinic.org",
  "workflow_description": "Navigate to Cleveland Clinic homepage. Verify the hero headline contains 'Every life deserves world class care'. Find and click the 'Find a Doctor' button.",
  "docs": "",
  "domain": "healthcare",
  "testing_type": "smoke",
  "test_data": {
    "username": "standard_user",
    "password": "secret_sauce",
    "firstName": "John",
    "lastName": "Doe",
    "postalCode": "12345"
  },
  "paths": {
    "trace": "projects/train_cleveland_clinic/outputs/trace.json",
    "report": "projects/train_cleveland_clinic/outputs/report.md",
    "test": "projects/train_cleveland_clinic/tests/e2e/test_main.py",
    "cache": "projects/train_cleveland_clinic/knowledge/locator_cache.json"
  },
  "master_plan": "Okay, here's a Master Test Plan tailored for Cleveland Clinic's website (my.clevelandclinic.org), focusing on a smoke test scenario and providing strategic mining instructions for autonomous agents.\n\n# Master Test Plan: Cleveland Clinic Website (Smoke Test)\n\n**Document Version:** 1.0\n**Date:** October 26, 2023\n**Target URL:** https://my.clevelandclinic.org\n**Business Domain:** Healthcare\n**Testing Type:** Smoke\n\n## 1. Introduction\n\nThis document outlines the master test plan for performing smoke tests on the Cleveland Clinic website (my.clevelandclinic.org). The purpose of this plan is to ensure the core functionality of the website is operational and that key user journeys are not blocked.  It is designed to guide autonomous agents in efficiently exploring the site and identifying potential issues.\n\n## 2. Domain Information & Analysis\n\n*   **Domain:** Healthcare (Hospital & Clinic Network)\n*   **Business Goal:** Provide information about medical services, connect patients with doctors, and facilitate access to healthcare resources. Cleveland Clinic is a leading non-profit academic medical center.\n*   **User Goal (as defined):** Navigate to Cleveland Clinic homepage, verify a key headline, and begin the doctor search process.\n*   **Key Areas of Focus:**\n    *   Website availability and performance.\n    *   Accuracy of core information (e.g., service descriptions, doctor profiles).\n    *   Functionality of critical navigation elements (menus, search).\n    *   Proper functioning of key interactive elements (forms, buttons).\n*   **Potential Risks:**\n    *   Outdated or inaccurate information.\n    *   Broken links or navigation issues.\n    *   Performance bottlenecks affecting user experience.\n    *   Accessibility issues hindering access for users with disabilities.\n*   **High-Value Content:** Doctor profiles, condition/treatment information, locations, appointment scheduling.\n\n## 3. Scope\n\nThis test plan covers the following:\n\n*   Verification of basic website availability.\n*   Navigation through the main menu.\n*   Verification of key homepage elements.\n*   Initiation of the \"Find a Doctor\" flow.\n\n## 4. Test Strategy\n\nThe test strategy is based on a smoke testing approach. This involves executing a small set of tests to quickly determine if the most important functionality of the website is working. This is intended as a \"health check\" before more extensive testing is performed.\n\n## 5. Smoke Suite Definition\n\nThis section defines the specific test cases included in the smoke suite.\n\n### 5.1 Website Availability\n\n*   **Test Case ID:** SMOKE-001\n*   **Description:** Verify that the Cleveland Clinic website is accessible.\n*   **Steps:**\n    1.  Navigate to https://my.clevelandclinic.org.\n    2.  Verify that the page loads successfully (HTTP status code 200).\n*   **Expected Result:** The website should load without errors.\n\n### 5.2 Core Navigation (Main Menu)\n\n*   **Test Case ID:** SMOKE-002\n*   **Description:** Verify that the main menu links are functional.\n*   **Steps:**\n    1.  Navigate to https://my.clevelandclinic.org.\n    2.  Locate the main navigation menu.\n    3.  Identify the following menu items: \"About Cleveland Clinic\", \"Patients & Visitors\", \"Medical Professionals\", \"Research & Education\"\n    4.  Click each menu item.\n    5.  Verify that clicking each item navigates to a relevant page.\n*   **Expected Result:** Each menu link should navigate to a corresponding page without errors.\n\n### 5.3 Core Flow: Verify Headline and Find a Doctor\n\n*   **Test Case ID:** SMOKE-003\n*   **Description:** Verify the presence of a specific headline on the homepage and initiate the \"Find a Doctor\" flow.\n*   **Steps:**\n    1.  Navigate to https://my.clevelandclinic.org.\n    2.  Locate the hero section of the homepage.\n    3.  **Verify** that the hero headline contains the text: \"Every life deserves world class care\".\n    4.  Locate the \"Find a Doctor\" button (or link).\n    5.  Click the \"Find a Doctor\" button (or link).\n    6.  Verify that clicking the button navigates to the \"Find a Doctor\" page or initiates the search process.  (Verify URL contains find-a-doctor or search/doctors)\n*   **Expected Result:** The headline should be present and contain the specified text. Clicking the \"Find a Doctor\" button should initiate the doctor search process.\n\n## 6. Strategic Mining Instructions for Autonomous Agents\n\nThese instructions are critical for guiding the autonomous agents in efficiently exploring the website and prioritizing relevant elements.\n\n*   **Prioritized Elements:**\n    *   **Hero Section:**  Specifically, the main headline and any call-to-action buttons within the hero area. The hero section is typically at the top of the landing page, so inspect this for content and links.\n    *   **Main Navigation Menu:** Extract all links and associated text for navigation analysis.\n    *   **Footer:** Extract all links and associated text.  Footers often contain important legal information, contact details, and sitemaps.\n    *   **\"Find a Doctor\" Button/Link:**  Locate and extract all attributes (text, URL, associated JavaScript events).\n*   **Prioritized Pages:**\n    *   **Homepage (/)**: Analyze the entire page structure, including headings, images, and links.\n    *   **\"About Cleveland Clinic\" Page (/about-cleveland-clinic)**:  Focus on the organization's mission, values, and history.\n    *   **\"Patients & Visitors\" Section:** Look for information related to appointment scheduling, billing, and patient resources.\n    *   **Find-a-doctor page:** Inspect the search parameters, filters, and the structure of doctor profiles.\n*   **Mining Strategies:**\n    *   **Text Content Analysis:** Focus on extracting and analyzing text related to medical conditions, treatments, and doctor specialties.\n    *   **Link Extraction:**  Extract all internal and external links to build a site map and identify potential broken links.\n    *   **Form Element Identification:** Identify all forms on the website (e.g., contact forms, appointment requests) and extract the associated input fields.\n*   **Specific Instructions:**\n    *   **Search for:** Use semantic search to locate elements related to \"appointment scheduling,\" \"patient portal,\" and \"medical specialties.\"\n    *   **Prioritize dynamic content:** Pay attention to elements that load dynamically (e.g., content loaded via AJAX) and ensure that they are correctly rendered.\n    *   **Accessibility Audit:**  Check for basic accessibility issues, such as missing ALT attributes on images and insufficient color contrast.\n\n## 7. Test Environment\n\n*   **Browser:** Chrome (latest version)\n*   **Operating System:** Windows 10 or macOS (latest version)\n*   **Network:** Stable internet connection\n\n## 8. Entry Criteria\n\n*   The website must be deployed and accessible at the specified URL (https://my.clevelandclinic.org).\n\n## 9. Exit Criteria\n\n*   All test cases in the smoke suite have been executed.\n*   No critical defects have been identified.\n\n## 10. Reporting\n\n*   A test report will be generated, summarizing the results of the smoke test.  This report will include the status of each test case (pass/fail), any defects identified, and relevant screenshots or logs.\n\n## 11. Automation Considerations\n\n*   The smoke test suite should be automated to allow for frequent and rapid execution.\n*   The automated tests should be integrated into the CI/CD pipeline to ensure that they are executed automatically whenever changes are made to the website.\n*   Consider using headless browser testing to improve performance and reduce resource consumption.\n\nThis Master Test Plan provides a solid foundation for smoke testing the Cleveland Clinic website. By following the strategic mining instructions, autonomous agents can efficiently explore the site and identify potential issues, ensuring a high-quality user experience. Remember that this is a living document and should be updated as the website evolves and new requirements emerge."
}