{
  "project_name": "train_mayo_clinic",
  "target_url": "https://www.mayoclinic.org",
  "workflow_description": "Navigate to Mayo Clinic homepage. Verify the hero headline contains 'Expert care, every day'. Find and click the 'Find Care' button.",
  "docs": "",
  "domain": "healthcare",
  "testing_type": "smoke",
  "test_data": {
    "username": "standard_user",
    "password": "secret_sauce",
    "firstName": "John",
    "lastName": "Doe",
    "postalCode": "12345"
  },
  "paths": {
    "trace": "projects/train_mayo_clinic/outputs/trace.json",
    "report": "projects/train_mayo_clinic/outputs/report.md",
    "test": "projects/train_mayo_clinic/tests/e2e/test_main.py",
    "cache": "projects/train_mayo_clinic/knowledge/locator_cache.json"
  },
  "master_plan": "# Master Test Plan: Mayo Clinic Website (Smoke Test)\n\n**Document Version:** 1.0\n**Date:** October 26, 2023\n**Author:** AI QA Strategist\n\n## 1. Introduction\n\nThis Master Test Plan outlines the strategy for smoke testing the Mayo Clinic website (https://www.mayoclinic.org). The goal is to ensure the website's core functionality is operational, the primary navigation is working, and a key user flow is executable. This plan will guide the automated testing agents in efficiently exploring, verifying, and reporting on the website's health.\n\n## 2. Domain Information\n\n**Website URL:** https://www.mayoclinic.org\n**Business Domain:** Healthcare\n\n**Domain Analysis:**\n\n*   **Purpose:** The Mayo Clinic website serves as a central hub for patients, healthcare professionals, and researchers seeking information about medical conditions, treatments, research, and appointment scheduling.\n*   **Key Features:** The website likely includes a comprehensive medical library, doctor directory, appointment booking system, patient portal, research publications, news, and information about the Mayo Clinic's various locations and services.\n*   **Target Audience:** Patients, potential patients, healthcare providers, researchers, students, and the general public.\n*   **Importance of Testing:** Given the critical nature of healthcare information, it is imperative that the Mayo Clinic website is highly reliable and accurate.\n\n## 3. Scope\n\nThis smoke test will cover the following aspects of the Mayo Clinic website:\n\n*   Website availability and basic functionality.\n*   Core navigation links and their destinations.\n*   A primary user flow: navigating to the homepage, verifying the hero headline, and initiating the \"Find Care\" process.\n\n## 4. Test Objectives\n\n*   Verify the website is accessible and loads successfully.\n*   Confirm that key navigation links are functional.\n*   Validate the presence and accuracy of a key element on the homepage.\n*   Verify the functionality of the \"Find Care\" button.\n\n## 5. Smoke Suite Definition\n\n### 5.1. Test Environment\n\n*   **Browser:** Chrome (latest stable version)\n*   **Operating System:** Windows 10/11 (representative of a large user base)\n*   **Network:** Stable internet connection\n\n### 5.2. Test Cases\n\n**TC_SMOKE_001: Website Availability and Core Navigation**\n\n*   **Description:** Verifies that the Mayo Clinic website is accessible and loads successfully. Checks the basic menu navigation links are functional.\n*   **Steps:**\n    1.  Navigate to https://www.mayoclinic.org.\n    2.  Verify that the page loads successfully with a 200 HTTP status code.\n    3.  Verify the presence of the main navigation menu (e.g., \"About Mayo Clinic,\" \"Patient Care & Health Info,\" \"Departments & Centers\").\n    4.  Click on each of the main navigation links.\n    5.  Verify that each link redirects to the expected page (check URL or page title).\n*   **Expected Result:** The website should load without errors, and all main navigation links should redirect to their respective pages.\n\n**TC_SMOKE_002: Homepage Hero Headline Verification**\n\n*   **Description:** Verifies the presence and content of the hero headline on the Mayo Clinic homepage.\n*   **Steps:**\n    1.  Navigate to https://www.mayoclinic.org.\n    2.  Locate the main hero headline element (e.g., using a CSS selector or XPath).\n    3.  Verify that the headline text contains \"Expert care, every day\".\n*   **Expected Result:** The homepage hero headline should be present and contain the expected text.\n\n**TC_SMOKE_003: \"Find Care\" Button Functionality**\n\n*   **Description:** Locates and clicks the \"Find Care\" button, verifying it navigates to the appropriate page.\n*   **Steps:**\n    1.  Navigate to https://www.mayoclinic.org.\n    2.  Locate the \"Find Care\" button (e.g., using a CSS selector or XPath - prioritize buttons with this text).\n    3.  Click the \"Find Care\" button.\n    4.  Verify that the page redirects to the \"Find Care\" page (verify URL contains `/appointments` or similar or that the page title contains \"Appointments\").\n*   **Expected Result:** Clicking the \"Find Care\" button should redirect the user to the correct page for appointment booking or care navigation.\n\n## 6. Strategic Mining Instructions\n\nThe autonomous agent should prioritize the following elements and pages for data extraction and analysis:\n\n*   **Homepage Hero Section:** Focus on extracting text content from the hero headline and any associated text or images.\n    *   Rationale: This section presents the core value proposition of Mayo Clinic.\n*   **Main Navigation Menu:** Extract all link text and corresponding URLs.\n    *   Rationale: This provides a site map and reveals key areas of the website.\n*   **\"Find Care\" Button:** Extract its text, location on the page, and the URL it links to. Also, extract any ARIA labels or attributes related to the button.\n    *   Rationale: This is a crucial call-to-action for patients seeking care.\n*   **Page Titles:** Extract the `<title>` tag content from all pages visited.\n    *   Rationale: Helps confirm correct page navigation and identify page context.\n*   **HTTP Status Codes:** Record the HTTP status code for every page accessed.\n    *   Rationale: Critical for identifying broken links and server errors.\n*   **Console Logs:** Capture any JavaScript console errors or warnings.\n    *   Rationale: Provides insights into client-side issues.\n\n## 7. Reporting\n\n*   The automated agent will generate a detailed report including:\n    *   Pass/Fail status of each test case.\n    *   Screenshots of key elements and pages.\n    *   HTTP status codes for each page accessed.\n    *   Console logs.\n    *   Any errors encountered during testing.\n    *   The report will clearly indicate any deviations from the expected results.\n\n## 8. Exit Criteria\n\n*   All smoke test cases must pass.\n*   No critical errors or warnings should be present in the console logs.\n*   The website should be accessible and responsive.\n\n## 9. Future Considerations\n\n*   Expand the test suite to include more comprehensive testing of key functionalities like appointment booking, medical library search, and patient portal access.\n*   Implement cross-browser and cross-device testing.\n*   Integrate the automated tests into the CI/CD pipeline for continuous testing.\n\nThis Master Test Plan provides a solid foundation for smoke testing the Mayo Clinic website. By following these guidelines, the automated agent can efficiently verify the website's health and ensure a positive user experience."
}