{
    "project_name": "google_finance_turbo",
    "target_url": "https://www.google.com/finance/",
    "goal": "Phase 1: Homepage & Market Overview. Load the Application: Navigate to https://www.google.com/finance/ and verify the page loads within 3 seconds. Verify Header Elements: Confirm the 'Google Finance' logo is visible in the top-left corner. Check Market Summary: Verify the 'Compare Markets' section (top row) displays major indices like S&P 500, Dow Jones, and Nasdaq. Validate Index Data: Ensure each index card shows a numeric price and a percentage change (green for positive, red for negative). Expand Market Data: Click on the S&P 500 chip/card and verify it redirects to the S&P 500 detail page. Return to Home: Click the Google Finance logo to return to the homepage. Check 'Market Trends': Scroll down to the 'Market Trends' section (Gainers, Losers, Most Active). Verify List Content: Confirm that the 'Most Active' list contains at least 5 stock tickers. Date/Time Verification: Verify the disclaimer text (usually at the bottom or near data) stating 'Data is real-time' or 'Delayed by 20 mins'. Phase 2: Search & Autosuggest. Activate Search: Click into the top search bar (placeholder text usually says 'Search for stocks, ETFs...'). Test Autosuggest: Type TES and verify that Tesla (TSLA) appears in the dropdown suggestions. Select by Click: Click the Tesla (TSLA) suggestion. Verify Navigation: Confirm the browser redirects to the URL containing /quote/TSLA. Invalid Search: Type a nonsense string (e.g., NON_EXISTENT_STOCK) and verify 'No results found' is displayed. Phase 3: Stock Detail Page (e.g., TSLA). Verify Price Visibility: Ensure the main stock price is displayed in a large font size. Check Price Change: Verify the 'Day's Change' (value and percentage) is visible next to the price. Interact with Chart (1 Day): Click the 1D (1 Day) button on the chart and verify the graph line appears. Interact with Chart (1 Year): Click the 1Y (1 Year) button and verify the x-axis scale changes to months/years. Chart Tooltip: Hover over any point on the chart line and verify a tooltip appears showing the specific date and price. Verify 'Key Stats': Scroll down to the 'Key Statistics' section and validate the presence of Market Cap, P/E Ratio, and Dividend Yield. Check 'About' Section: Verify a paragraph of text describing the company is visible. Check 'Financials' Snapshot: Scroll to the 'Financials' card and verify the 'Income Statement' bars (Revenue/Net Income) are rendered. Phase 4: Comparison Features (Key Lite Feature). Initiate Comparison: On the Stock Detail Page, look for the 'Compare to' button (or '+' icon near the chart). Add Comparison Stock: Click 'Compare' and select (or type) Ford (F). Verify Multi-Line Chart: Confirm that a second line (usually a different color) appears on the chart representing Ford. Verify Legend: Check that the chart legend now lists both Tesla and Ford. Remove Comparison: Click the X next to Ford in the comparison chip/legend to remove it. Phase 5: Navigation & Responsiveness. Test Side Navigation: If on desktop, click 'Watchlists' or 'Portfolios' in the left sidebar (requires login, or prompts login page—verify the prompt). Verify 'Discover' Tab: Click on 'Discover' (or similar exploration link) and verify it shows lists like 'Climate Leaders' or 'Crypto'. Footer Links: Scroll to the absolute bottom and click 'Send Feedback' (or Help) and verify a modal or help page opens.",
    "max_steps": 50,
    "headless": true
}