{
  "project_name": "train_intuit_quickbooks",
  "target_url": "https://quickbooks.intuit.com",
  "workflow_description": "Navigate to Intuit QuickBooks homepage. Verify the hero headline contains 'Smarter business tools for the world's hardest workers'. Find and click the 'Try it free' button.",
  "docs": "",
  "domain": "general",
  "testing_type": "smoke",
  "test_data": {
    "username": "standard_user",
    "password": "secret_sauce",
    "firstName": "John",
    "lastName": "Doe",
    "postalCode": "12345"
  },
  "paths": {
    "trace": "projects/train_intuit_quickbooks/outputs/trace.json",
    "report": "projects/train_intuit_quickbooks/outputs/report.md",
    "test": "projects/train_intuit_quickbooks/tests/e2e/test_main.py",
    "cache": "projects/train_intuit_quickbooks/knowledge/locator_cache.json"
  },
  "master_plan": "Okay, here's a Master Test Plan for QuickBooks.com, designed to guide autonomous agents in performing a focused smoke test.\n\n# Master Test Plan: QuickBooks.com - Smoke Test\n\n**Date:** October 26, 2023\n**Target URL:** https://quickbooks.intuit.com\n**Business Domain:** Financial Software, Small Business Solutions\n**Testing Type:** Smoke Test\n**Overall Goal:**  Ensure core website functionality is operational, focusing on initial page load, key navigation, and a critical user flow (starting a free trial).\n\n## 1. Domain Information & Analysis\n\nQuickBooks is a leading provider of financial management and accounting software for small businesses, self-employed individuals, and accountants.  The website serves as a primary marketing and sales platform, providing information about products, pricing, support, and resources.  A functioning website is crucial for customer acquisition, lead generation, and maintaining brand reputation.\n\n**Key Areas of Focus Based on Domain:**\n\n*   **Reliability:** The website *must* be consistently available. Financial data trust hinges on reliability.\n*   **User Experience (UX):** Navigation must be intuitive, guiding users towards relevant information and calls to action (e.g., signing up for a free trial).\n*   **Call to Action Effectiveness:**  The primary CTAs (e.g., \"Try it Free,\" \"Buy Now\") should be prominent and functional.\n*   **Content Accuracy:** While this test focuses on functionality, the hero headline check touches on content integrity.\n\n## 2. Smoke Suite Definition\n\nThis smoke suite will verify the fundamental health of the QuickBooks website.\n\n**Test Suite Name:** QuickBooks Smoke Test\n\n**Tests Included:**\n\n### 2.1 Website Availability\n\n*   **Test Case ID:** SMOKE-001\n*   **Test Name:** Verify Website is Up\n*   **Description:** Checks if the QuickBooks homepage is accessible and returns a 200 OK HTTP status code.\n*   **Steps:**\n    1.  Navigate to https://quickbooks.intuit.com\n    2.  Verify the HTTP status code is 200.\n*   **Expected Result:** HTTP status code 200 OK.\n\n### 2.2 Core Navigation\n\n*   **Test Case ID:** SMOKE-002\n*   **Test Name:** Verify Top Navigation Links\n*   **Description:** Checks if the main navigation links in the header are present and clickable.\n*   **Steps:**\n    1.  Navigate to https://quickbooks.intuit.com\n    2.  Locate the main navigation menu (e.g., using a CSS selector like `#primary-nav` or similar).\n    3.  Identify the top-level links (e.g., \"Products\", \"Pricing\", \"Small Business Resources\", \"Accountants\").\n    4.  For each link, verify that:\n        *   It is present on the page.\n        *   It is clickable (responds to a click event).\n*   **Expected Result:** All top-level navigation links are present and clickable. No broken links.\n\n### 2.3 Core Flow - \"Try it Free\"\n\n*   **Test Case ID:** SMOKE-003\n*   **Test Name:** Verify Hero Headline and \"Try it Free\" Button\n*   **Description:** Navigates to the homepage, verifies the main headline, and clicks the \"Try it Free\" button.\n*   **Steps:**\n    1.  Navigate to https://quickbooks.intuit.com\n    2.  **Verify Hero Headline:**\n        *   Locate the main headline element on the page (e.g., using a CSS selector like `h1.hero-headline` or similar - **AGENT: This selector may need adjustment based on actual page structure**).\n        *   Verify the headline text *contains* the string: \"Smarter business tools for the world's hardest workers\". (A partial match is acceptable for this smoke test.)\n    3.  **Click \"Try it Free\" Button:**\n        *   Locate the \"Try it Free\" button (e.g., using a CSS selector like `a.btn.btn-primary[href*=\"free-trial\"]` or similar - **AGENT: This selector may need adjustment based on actual page structure and button attributes**).\n        *   Click the button.\n    4. Verify navigation to a page that represents a 'free trial' flow. (Agent: Confirm the URL change after the click)\n*   **Expected Result:**\n    *   The hero headline contains the expected text.\n    *   The \"Try it Free\" button is clickable and navigates to a relevant page (e.g., a sign-up form or product selection page).\n\n## 3. Strategic Mining Instructions\n\nThese instructions guide the agent in prioritizing element identification and data extraction for the Smoke Suite.\n\n*   **Prioritize Identification:**\n    *   **Hero Headline:**  The agent *must* accurately locate and extract the text of the main headline on the homepage.  Experiment with different CSS selectors or XPath expressions if the initial suggestion fails.\n    *   **\"Try it Free\" Button:**  The agent *must* accurately locate the primary \"Try it Free\" button on the homepage. Pay close attention to button attributes (e.g., `href`, `class`, `id`) to ensure the correct button is targeted.\n    *   **Top Navigation Links:** The agent should find the common container for the links, then iterate to get all the 'a' tags inside.\n\n*   **Data Extraction:**\n    *   Extract the `href` attribute for each navigation link to confirm valid URLs.\n    *   Extract the text content of the Hero Headline.\n\n*   **Error Handling:**\n    *   If the agent cannot locate an element (e.g., the \"Try it Free\" button), it should log a detailed error message including the attempted selector and surrounding HTML.\n    *   If a navigation link returns an error (e.g., 404), log the URL and error code.\n\n## 4. Reporting\n\nThe agent should generate a clear and concise report indicating:\n\n*   The status of each test case (Pass/Fail).\n*   Error messages for failed tests.\n*   Execution time for the entire suite.\n*   Screenshots of the page at key steps (e.g., before and after clicking the \"Try it Free\" button).\n*   List of URLs that failed.\n\n## 5. Future Considerations (Beyond Smoke Test)\n\n*   **Responsiveness:** Verify the website's layout and functionality on different screen sizes (desktop, tablet, mobile).\n*   **Accessibility:**  Perform basic accessibility checks (e.g., using automated tools) to identify potential issues.\n*   **Performance:** Measure page load times to ensure optimal performance.\n*   **Cross-Browser Compatibility:**  Execute the smoke test on different browsers (Chrome, Firefox, Safari, Edge)."
}