[
  {
    "url": "https://automationexercise.com/",
    "title": "Automation Exercise",
    "summary": "This is a practice website called AutomationExercise for QA engineers of all levels to practice automation and API testing. It provides test cases and API lists for practice, categorized by gender (women, men, kids) and brands (e.g., POLO, H&M)."
  },
  {
    "url": "https://automationexercise.com/contact_us",
    "title": "Automation Exercise - Contact Us",
    "summary": "The page is a 'Contact Us' form for the Automation Exercise website. It includes a contact form for testing purposes, a feedback section, and a subscription section."
  },
  {
    "url": "https://automationexercise.com/product_details/14",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, 'Full Sleeves Top Cherry - Pink', including its category (Kids > Tops & Shirts), price (Rs. 679), availability (In Stock), condition (New), and brand (Kookie Kids). It also allows users to add the product to the cart, write and submit a review, and subscribe to receive updates."
  },
  {
    "url": "https://automationexercise.com/category_products/1",
    "title": "Automation Exercise - Dress Products",
    "summary": "This webpage displays dress products for women in an online store. It includes product listings with prices, images, and 'Add to cart' buttons. The page also features category filters (Women, Men, Kids), brand filters (POLO, H&M, etc.), and links to other sections of the website (Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, Contact us)."
  },
  {
    "url": "https://automationexercise.com/product_details/30",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, 'Premium Polo T-Shirts', including its category (Men > Tshirts), price (Rs. 1500), availability (In Stock), condition (New), and brand (Polo). It also allows users to add the product to their cart, write and submit a review, and subscribe to receive updates."
  },
  {
    "url": "https://automationexercise.com/product_details/2",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a 'Men Tshirt' product from the Automation Exercise website. It shows the product's category (Men > Tshirts), price (Rs. 400), availability (In Stock), condition (New), and brand (H&M). It also includes options to add the product to the cart, write a review, and subscribe to updates."
  },
  {
    "url": "https://automationexercise.com/brand_products/Babyhug",
    "title": "Automation Exercise - Babyhug Products",
    "summary": "This is a summary of the Babyhug Products page on an e-commerce website. The page allows users to browse and add Babyhug products to their cart. It includes product listings with images, prices, and 'Add to cart' buttons. The page also features category filters (WOMEN, MEN, KIDS, BRANDS) and specific brand filters (POLO, H&M, MADAME, MAST & HARBOUR, BABYHUG, ALLEN SOLLY JUNIOR, KOOKIE KIDS, BIBA). The page also has links to Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, and Contact us."
  },
  {
    "url": "https://automationexercise.com/product_details/40",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product (Rust Red Linen Saree) on an e-commerce website. It shows the product category, price, quantity input, availability, condition, and brand. It also includes a section for writing and submitting a review, as well as a subscription form for updates."
  },
  {
    "url": "https://automationexercise.com/product_details/20",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, 'Cotton Mull Embroidered Dress', including its category (Kids > Dress), price (Rs. 1190), availability (In Stock), condition (New), and brand (Kookie Kids). It allows users to add the product to the cart, write and submit a review, and subscribe to receive updates."
  },
  {
    "url": "https://automationexercise.com/product_details/39",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, 'Cotton Silk Hand Block Print Saree', including its category (Women > Saree), price (Rs. 3000), availability (In Stock), condition (New), and brand (Biba). It also allows users to add the product to the cart, write a review, and subscribe to updates."
  },
  {
    "url": "https://automationexercise.com/product_details/19",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, a Sleeveless Unicorn Patch Gown - Pink, including its category (Kids > Dress), price (Rs. 1050), availability (In Stock), condition (New), and brand (Allen Solly Junior). It also allows users to add the product to their cart, write a review, and subscribe to updates."
  },
  {
    "url": "https://automationexercise.com/category_products/5",
    "title": "Automation Exercise - Tops & Shirts Products",
    "summary": "This webpage displays a list of 'Tops & Shirts' products for kids on an e-commerce site. It allows users to add products to the cart and view product details. The page also includes navigation links to Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, and Contact us. It also has category filters for Women, Men, and Kids, as well as brand filters."
  },
  {
    "url": "https://automationexercise.com/brand_products/Mast%20&%20Harbour",
    "title": "Automation Exercise - Mast & Harbour Products",
    "summary": "This webpage is for an e-commerce site, specifically for the brand Mast & Harbour. It displays a list of Mast & Harbour products, including winter tops and lace tops, with prices and 'Add to cart' buttons. The site also has categories for Women, Men, and Kids, as well as other brands. Navigation includes links to Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, and Contact us."
  },
  {
    "url": "https://automationexercise.com/product_details/4",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, including its category, price, availability, condition, brand, and a form to write a review. It also includes options to add the product to the cart and a subscription section for updates."
  },
  {
    "url": "https://automationexercise.com/product_details/22",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, specifically a 'Long Maxi Tulle Fancy Dress Up Outfits - Pink'. It shows the product's category (Kids > Dress), price (Rs. 1600), availability (In Stock), condition (New), and brand (Biba). Users can add the product to their cart, write a review, and subscribe to receive updates."
  },
  {
    "url": "https://automationexercise.com/product_details/31",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product, a 'Pure Cotton Neon Green Tshirt'. It shows the product's category (Men > Tshirts), price (Rs. 850), availability (In Stock), condition (New), and brand (H&M). It also includes options to add the product to the cart, write a review, and subscribe to updates. The page also contains navigation links to Home, Products, Cart, Signup/Login, Test Cases, API Testing, and Video Tutorials, Contact us, as well as product categories (WOMEN, MEN, KIDS) and brands (POLO, H&M, MADAME, MAST & HARBOUR, BABYHUG, ALLEN SOLLY JUNIOR, KOOKIE KIDS, BIBA)."
  },
  {
    "url": "https://automationexercise.com/product_details/16",
    "title": "Automation Exercise - Product Details",
    "summary": "This page displays the details of a product called 'Sleeves Top and Short - Blue & Pink' from the Babyhug brand, categorized under Kids > Dress. It shows the price (Rs. 478), availability (In Stock), condition (New), and allows users to add it to the cart, write a review, and subscribe to updates."
  },
  {
    "url": "https://automationexercise.com/brand_products/Polo",
    "title": "Automation Exercise - Polo Products",
    "summary": "This webpage is an online store, specifically showcasing Polo brand products. It features a homepage with navigation links (Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, Contact us), product categories (WOMEN, MEN, KIDS, BRANDS), and a selection of Polo products with details like price and 'Add to cart' options. Some products also have a 'View Product' option."
  },
  {
    "url": "https://automationexercise.com/brand_products/Biba",
    "title": "Automation Exercise - Biba Products",
    "summary": "This is the homepage of an e-commerce website called Biba Products. The page displays a navigation bar with links to Home, Products, Cart, Signup/Login, Test Cases, API Testing, Video Tutorials, and Contact us. The main content area lists products from the Biba brand, including dresses with prices and 'Add to cart' buttons. There are also category filters for Women, Men, and Kids, as well as brand filters for POLO, H&M, MADAME, MAST & HARBOUR, BABYHUG, ALLEN SOLLY JUNIOR, and KOOKIE KIDS."
  },
  {
    "url": "https://automationexercise.com/api_list",
    "title": "Automation Practice for API Testing",
    "summary": "This webpage provides a platform for API testing practice. It includes a list of APIs with scenarios for automation practice, covering functionalities like retrieving product lists, posting data, searching products, and user login verification."
  }
]