{
  "project_name": "train_browserstack",
  "target_url": "https://www.browserstack.com",
  "workflow_description": "Navigate to BrowserStack homepage. Verify the hero headline contains 'Test on real devices and browsers'. Find and click the 'Get Started' button.",
  "docs": "",
  "domain": "general",
  "testing_type": "smoke",
  "test_data": {
    "username": "standard_user",
    "password": "secret_sauce",
    "firstName": "John",
    "lastName": "Doe",
    "postalCode": "12345"
  },
  "paths": {
    "trace": "projects/train_browserstack/outputs/trace.json",
    "report": "projects/train_browserstack/outputs/report.md",
    "test": "projects/train_browserstack/tests/e2e/test_main.py",
    "cache": "projects/train_browserstack/knowledge/locator_cache.json"
  },
  "master_plan": "# Master Test Plan: BrowserStack - Smoke Test Suite\n\n## 1. Domain Information\n\n*   **Website URL:** https://www.browserstack.com\n*   **Business Domain:** Cloud-based web and mobile testing platform. BrowserStack provides infrastructure for running automated and manual tests on a wide range of real devices and browsers.\n*   **Goal:** Ensure core functionality of the BrowserStack website is operational and key user journeys are accessible.\n*   **Target User:** New or returning user.\n*   **User Task Focus:** Verify core landing page elements, navigation, and a key conversion flow (Get Started).\n\n## 2. Smoke Suite Definition\n\nThis Smoke Suite aims to provide a rapid assessment of the BrowserStack website's health and stability. It focuses on verifying:\n\n*   The website is accessible and loads correctly.\n*   Core navigation elements are functional.\n*   Key content elements are present and accurate.\n*   A primary user flow (navigating to \"Get Started\") is operational.\n\n### 2.1. Test Cases\n\n| Test Case ID | Description                                                        | Priority | Steps                                                                                                        | Expected Result                                                                                      |\n|--------------|--------------------------------------------------------------------|----------|-------------------------------------------------------------------------------------------------------------|----------------------------------------------------------------------------------------------------|\n| SMOKE-001    | Website Availability                                              | High     | 1. Navigate to https://www.browserstack.com                                                                | 1. Website loads successfully with no errors.                                                     |\n| SMOKE-002    | Verify Hero Headline                                               | High     | 1. Navigate to https://www.browserstack.com                                                                | 1. Hero headline contains the text \"Test on real devices and browsers\".                              |\n| SMOKE-003    | Find 'Get Started' Button                                              | High     | 1. Navigate to https://www.browserstack.com                                                                | 1. Button is found.                                                             |\n| SMOKE-004    | Click 'Get Started' Button                                              | High     | 1. Navigate to https://www.browserstack.com<br>2. Click the 'Get Started' button.                                                                | 1. User is directed to the sign-up page.                                                             |\n| SMOKE-005    | Verify Sign-up Page                                              | High     | 1. Navigate to https://www.browserstack.com<br>2. Click the 'Get Started' button.                                                                | 1. User is directed to the sign-up page with all the relevant fields.                                                             |\n\n## 3. Strategic Mining Instructions\n\nThese instructions guide the autonomous agent on where to focus its attention and what data to extract for verification.\n\n*   **Prioritized Elements:**\n    *   **Hero Headline (Landing Page):** Extract the text content of the main headline on the homepage. Verify it includes the phrase \"Test on real devices and browsers\". This element is critical for conveying the core value proposition.\n    *   **\"Get Started\" Button:** Locate the \"Get Started\" button (or similar call-to-action) on the homepage.  Verify its presence and that its `href` attribute points to a relevant sign-up or trial page.\n*   **Content Mining Strategy:**\n    *   **Prioritize Visible Text:** Focus on extracting text content that is visible to the user.  Ignore text within hidden elements or tooltips (unless specified otherwise).\n    *   **Semantic Elements:** Prioritize mining content from semantic HTML elements (e.g., `<h1>`, `<p>`, `<a>`) as these are more likely to contain important information.\n*   **Page Focus:**\n    *   **Homepage:** The initial focus should be on the homepage, as this is the primary entry point for most users.\n    *   **Sign-up Page:** After clicking 'Get Started', mine and verify the sign-up page.\n*   **Dynamic Content Handling:**\n    *   **If A/B testing is suspected:** Be aware of the possibility of A/B testing on the headline or button text. If variations are detected, log the different versions encountered. While this smoke test focuses on the *presence* of key elements, noting variations will inform future, more comprehensive testing.\n*   **Error Handling:**\n    *   **Network Errors:** Capture any network errors encountered while loading the page. This is critical for identifying availability issues.\n    *   **JavaScript Errors:** Monitor the browser console for JavaScript errors. These errors can indicate functional problems on the page.\n*   **Data Structure for Reporting:**\n    *   The agent should produce a report containing:\n        *   Page load time for each page visited.\n        *   The exact text content of the Hero Headline.\n        *   The presence and `href` attribute of the \"Get Started\" button.\n        *   A list of any network or JavaScript errors encountered.\n        *   The status (Pass/Fail) of each test case in Section 2.1.\n\nThis Master Test Plan provides a structured approach to smoke testing the BrowserStack website. By following these guidelines, the autonomous agent can effectively identify critical issues and ensure the website is functioning as expected."
}