{
  "project_name": "train_linear",
  "target_url": "https://linear.app",
  "workflow_description": "Navigate to Linear homepage. Verify the hero headline contains 'The issue tracker for modern teams'. Find and click the 'Sign Up' button.",
  "docs": "",
  "domain": "saas",
  "testing_type": "smoke",
  "test_data": {
    "username": "standard_user",
    "password": "secret_sauce",
    "firstName": "John",
    "lastName": "Doe",
    "postalCode": "12345"
  },
  "paths": {
    "trace": "projects/train_linear/outputs/trace.json",
    "report": "projects/train_linear/outputs/report.md",
    "test": "projects/train_linear/tests/e2e/test_main.py",
    "cache": "projects/train_linear/knowledge/locator_cache.json"
  },
  "master_plan": "Okay, here's a Master Test Plan for Linear.app, designed to guide autonomous agents in performing smoke tests. This plan focuses on the core functionality and user goal outlined.\n\n# Master Test Plan: Linear.app - Smoke Testing\n\n**1. Introduction**\n\nThis document outlines the Master Test Plan for smoke testing the Linear.app website (https://linear.app). The primary goal is to ensure the website is functional, navigable, and that key user flows are operational. This plan will guide the autonomous agents in identifying critical elements, performing core verifications, and structuring the test suite for maximum efficiency and coverage.\n\n**2. Domain Information & Analysis**\n\n*   **Website URL:** https://linear.app\n*   **Business Domain:** SaaS (Software as a Service) - Issue Tracking & Project Management.\n*   **Target Audience:** Software development teams, project managers, product managers.\n*   **Key Value Proposition:** Linear aims to provide a streamlined, efficient, and modern issue tracking experience, improving team collaboration and productivity.\n*   **Assumptions:**\n    *   The website is the primary entry point for new users to learn about and sign up for the service.\n    *   Consistent branding and messaging are crucial for conveying trust and value.\n    *   Navigation should be intuitive to guide users toward key actions (e.g., Sign Up, Learn More).\n\n**3. Test Scope: Smoke Testing**\n\nThis test plan focuses on *smoke testing*. Smoke tests are a high-level, rapid assessment to determine if the core functionalities of the application are working as expected. The tests are designed to catch major issues early in the development cycle.\n\n**Out-of-Scope:**\n*   Detailed functional testing of specific features.\n*   Performance testing (load, stress).\n*   Security testing.\n*   Accessibility testing (WCAG compliance).\n*   Cross-browser compatibility testing beyond ensuring basic rendering in major browsers.\n*   Detailed error handling and edge cases.\n\n**4. Smoke Test Suite Definition**\n\nThis section details the specific tests that will be executed as part of the smoke test suite.\n\n**4.1. Test Case 1: Website Availability & Core Navigation**\n\n*   **Test ID:** SMOKE-001\n*   **Test Description:** Verify the Linear.app homepage is accessible and that core navigation links are functional.\n*   **Steps:**\n    1.  Navigate to https://linear.app.\n    2.  Verify that the HTTP status code is 200 (OK).\n    3.  Verify that the page title is present and relevant (e.g., \"Linear | Issue Tracking Software for Agile Teams\").\n    4.  Verify that main menu links are present (e.g. \"Features\", \"Pricing\", \"Customers\", \"About\", \"Sign In\")\n    5.  For *each* main menu link:\n        *   Click the link.\n        *   Verify that the page loads without errors.\n        *   Verify that the URL changes appropriately.\n*   **Expected Result:**\n    *   The homepage loads successfully.\n    *   The page title is correct.\n    *   All main menu links are present and lead to valid pages within the Linear.app domain.\n*   **Priority:** Critical\n\n**4.2. Test Case 2: Hero Headline Verification**\n\n*   **Test ID:** SMOKE-002\n*   **Test Description:** Verify that the hero section headline on the homepage contains the expected text.\n*   **Steps:**\n    1.  Navigate to https://linear.app.\n    2.  Locate the main headline element in the hero section (e.g., using a CSS selector like `h1` or a specific class).\n    3.  Verify that the text content of the headline element *contains* the string \"The issue tracker for modern teams\".\n*   **Expected Result:** The hero headline contains the expected text, confirming the core messaging is present.\n*   **Priority:** Critical\n\n**4.3. Test Case 3: Sign Up Button Functionality**\n\n*   **Test ID:** SMOKE-003\n*   **Test Description:** Verify that the \"Sign Up\" button is present and functional, directing the user to the registration page.\n*   **Steps:**\n    1.  Navigate to https://linear.app.\n    2.  Locate the \"Sign Up\" button (e.g., using text matching, CSS selector, or XPath).\n    3.  Click the \"Sign Up\" button.\n    4.  Verify that the user is redirected to the sign-up page (e.g., a URL containing `/signup` or `/register`).\n*   **Expected Result:** The \"Sign Up\" button redirects the user to the registration page.\n*   **Priority:** Critical\n\n**4.4. Test Case 4: End-to-End Happy Path (Homepage -> Sign Up)**\n\n*   **Test ID:** SMOKE-004\n*   **Test Description:** Execute a simple end-to-end \"happy path\" scenario: Navigating to the homepage and attempting to sign up.\n*   **Steps:**\n    1.  Navigate to https://linear.app.\n    2.  Locate and click the \"Sign Up\" button.\n    3.  Verify that the user is redirected to the sign-up page\n    4.  Verify that the sign-up page contains input fields such as 'email' and 'password'.\n*   **Expected Result:**  The \"Sign Up\" button redirects the user to a signup form on an appropriate page.\n*   **Priority:** Critical\n\n**5. Strategic Mining Instructions for Autonomous Agents**\n\nThese instructions guide the autonomous agents in identifying and prioritizing elements for testing.\n\n*   **Prioritize elements that are:**\n    *   Visible on the initial page load (above the fold).\n    *   Part of the main navigation.\n    *   Related to key actions like \"Sign Up,\" \"Login,\" or \"Free Trial.\"\n*   **Specific Elements to Mine:**\n    *   **Hero Headline:**  Identify the main headline element on the homepage.  Look for `<h1>` tags, elements with classes like `hero-title`, or elements containing the text \"issue tracker\".\n    *   **Navigation Links:**  Identify all links within the main navigation menu.  Look for `<nav>` elements and `<a>` tags within them.\n    *   **\"Sign Up\" Button:** Locate the \"Sign Up\" button by searching for button elements (`<button>`) or link elements (`<a>`) containing the text \"Sign Up,\" \"Register,\" or similar variations. Also inspect for elements with classes like `sign-up-button` or `register-button`.\n*   **Pages to Prioritize:**\n    *   Homepage (https://linear.app)\n    *   Sign-up page (likely a URL containing `/signup` or `/register` - discover this through link analysis).\n*   **Mining Strategy:**\n    1.  Start with the homepage and identify the key elements listed above.\n    2.  Follow links from the homepage to discover the sign-up page.\n    3.  Focus on extracting text content, attributes (e.g., `href` for links), and element types.\n\n**6. Test Environment**\n\n*   **Browser:** Chrome (latest version) is the primary target.\n*   **Operating System:** Platform agnostic (tests should run on any OS).\n*   **Network:** A stable internet connection is required.\n\n**7. Test Data**\n\n*   No specific test data is required for smoke tests, as the focus is on verifying functionality and navigation, not data input.\n\n**8. Reporting**\n\n*   The autonomous agents should generate a clear and concise test report indicating:\n    *   Test case ID\n    *   Test case description\n    *   Status (Pass/Fail)\n    *   Error messages (if any)\n    *   Screenshots (for failures)\n    *   Execution Time\n\n**9. Success Criteria**\n\n*   All smoke tests must pass to consider the build stable.\n*   If any smoke tests fail, the build should be considered unstable and further investigation is required.\n\n**10. Future Considerations**\n\n*   As the application evolves, this test plan should be reviewed and updated to reflect new features and changes to existing functionality.\n*   Expand the test suite to include more comprehensive functional tests beyond the scope of smoke testing.\n*   Incorporate performance and security testing into the overall testing strategy.\n\nThis Master Test Plan provides a solid foundation for automated smoke testing of Linear.app. By following these guidelines, the autonomous agents can effectively identify and verify the core functionality of the website, ensuring a high-quality user experience."
}