{
  "project_name": "train_atlassian_jira",
  "target_url": "https://www.atlassian.com/software/jira",
  "workflow_description": "Navigate to Atlassian Jira homepage. Verify the hero headline contains 'Plan, track, and release great software'. Find and click the 'Try it free' button.",
  "docs": "",
  "domain": "general",
  "testing_type": "smoke",
  "test_data": {
    "username": "standard_user",
    "password": "secret_sauce",
    "firstName": "John",
    "lastName": "Doe",
    "postalCode": "12345"
  },
  "paths": {
    "trace": "projects/train_atlassian_jira/outputs/trace.json",
    "report": "projects/train_atlassian_jira/outputs/report.md",
    "test": "projects/train_atlassian_jira/tests/e2e/test_main.py",
    "cache": "projects/train_atlassian_jira/knowledge/locator_cache.json"
  },
  "master_plan": "## Master Test Plan: Atlassian Jira (Smoke Test)\n\n**Date:** October 26, 2023\n**Version:** 1.0\n**Prepared by:** AI QA Strategist\n\n### 1. Introduction\n\nThis document outlines the Master Test Plan for the Atlassian Jira website (https://www.atlassian.com/software/jira), focusing on smoke testing. The purpose of this plan is to define the scope, objectives, and approach for verifying the basic functionality and stability of the Jira website. This plan will guide the autonomous agents in mining, verifying, and structuring the test suite.\n\n### 2. Domain Information\n\n*   **Website URL:** https://www.atlassian.com/software/jira\n*   **Business Domain:** Project Management / Software Development Tools\n*   **Target Audience:** Project managers, software developers, IT teams, and other professionals involved in planning, tracking, and releasing software.\n*   **Website Goal:** To promote and enable users to sign up for and use Atlassian's Jira project management software.  The site aims to showcase features, benefits, and pricing, ultimately driving user acquisition and product adoption.\n\n### 3. Testing Scope\n\nThis smoke test will focus on the core functionality of the Jira homepage, ensuring the website is accessible, key elements are present, and basic user flows are functional.\n\n**In Scope:**\n\n*   Website availability and load time.\n*   Verification of key UI elements on the homepage (hero headline, primary CTA).\n*   Navigation via main menu links.\n*   Basic \"Happy Path\" user flow: navigating to the homepage and initiating a free trial.\n\n**Out of Scope:**\n\n*   Detailed testing of all features and functionalities within the Jira application.\n*   Testing on different browsers or devices (initial execution will be on a default, modern browser).\n*   Performance testing, security testing, or accessibility testing.\n*   Testing of error handling and edge cases.\n*   Testing of links to external sites.\n\n### 4. Smoke Suite Definition\n\nThe Smoke Suite will consist of the following test cases:\n\n#### 4.1 Website Availability and Basic Checks\n\n*   **Test Case ID:** SMOKE-001\n*   **Test Description:** Verify that the Jira homepage is accessible and loads successfully.\n*   **Test Steps:**\n    1.  Navigate to https://www.atlassian.com/software/jira.\n    2.  Verify that the page loads within an acceptable timeframe (e.g., under 5 seconds).\n    3.  Verify the HTTP status code is 200.\n*   **Expected Result:** The Jira homepage loads successfully with a 200 HTTP status code within the acceptable timeframe.\n\n#### 4.2 Core Navigation\n\n*   **Test Case ID:** SMOKE-002\n*   **Test Description:** Verify the main navigation menu links are functional.\n*   **Test Steps:**\n    1.  Navigate to https://www.atlassian.com/software/jira.\n    2.  Locate the main menu (e.g., using a semantic tag like `<nav>` or `role=\"navigation\"`).\n    3.  Identify the top-level menu items (e.g., \"Products\", \"Solutions\", \"Pricing\", \"Resources\").\n    4.  Click each menu item and verify that it navigates to the expected page.\n*   **Expected Result:** All main menu links navigate to the correct corresponding pages without errors.\n\n#### 4.3 Core Flow: \"Try it Free\"\n\n*   **Test Case ID:** SMOKE-003\n*   **Test Description:** Verify the \"Try it Free\" button on the homepage navigates the user to the registration page.\n*   **Test Steps:**\n    1.  Navigate to https://www.atlassian.com/software/jira.\n    2.  Locate the \"Try it Free\" button (using text matching or a CSS selector based on its visual prominence).\n    3.  Click the \"Try it Free\" button.\n    4.  Verify that the user is redirected to a page related to Jira free trial signup (e.g., a page containing elements like \"Sign up for free\", or a URL containing \"atlassian.com/try/jira\").\n*   **Expected Result:** Clicking the \"Try it Free\" button redirects the user to a Jira free trial signup page.\n\n#### 4.4 Hero Headline Verification\n\n*   **Test Case ID:** SMOKE-004\n*   **Test Description:** Verify the hero headline on the homepage contains the expected text.\n*   **Test Steps:**\n    1.  Navigate to https://www.atlassian.com/software/jira.\n    2.  Locate the main hero headline (likely an `<h1>` tag, or a prominent heading with specific styling).\n    3.  Verify that the headline text contains the string \"Plan, track, and release great software\".\n*   **Expected Result:** The hero headline contains the expected text.\n\n### 5. Strategic Mining Instructions\n\nThe autonomous agent should prioritize mining the following elements and pages:\n\n*   **Prioritize:** The homepage (`/software/jira`).\n*   **Focus Elements:**\n    *   `<h1>` tag on the homepage (for the hero headline).\n    *   `<nav>` tag or elements with `role=\"navigation\"` (for identifying the main menu).\n    *   Buttons containing the text \"Try it Free\" or similar variations.  Use `button`, `a` tags.\n*   **Mining Depth:** Scan the DOM for textual content of the elements mentioned above and their associated links (`href` attribute).\n*   **Data to Extract:**\n    *   Text content of the hero headline.\n    *   `href` attributes of the menu links.\n    *   `href` attribute of the \"Try it Free\" button.\n    *   Full URL of the current page after clicking the \"Try it Free\" button.\n\n### 6. Test Environment\n\n*   **Browser:** Latest version of Chrome (default).\n*   **Operating System:** Platform independent (cloud-based execution).\n\n### 7. Reporting\n\n*   Test results will be reported in a clear and concise format, indicating pass/fail status for each test case.\n*   Failed test cases will include detailed error messages and relevant context (e.g., screenshots, console logs).\n\n### 8. Success Criteria\n\nThe smoke test is considered successful if all test cases pass, indicating that the core functionality of the Jira website is working as expected.\n\n### 9. Future Considerations\n\n*   Expand the test suite to cover more features and functionalities.\n*   Implement cross-browser and cross-device testing.\n*   Integrate performance and security testing.\n*   Automate the test execution process."
}